# GetDefaultTextSize

## Description
Function GetDefaultTextSize returns the default text size in points.

72 points are equal to one(1) inch.

```pascal
FUNCTION GetDefaultTextSize : REAL;
```

```python
def vs.GetDefaultTextSize():
    return REAL
```

## Remarks
Returns the default text size in points.

[sd  8/19/98]

## Examples
```pascal
resultVal := GetDefaultTextSize;
```
```python
import vs

# Function GetDefaultTextSize returns the default text size in points.
value = vs.GetDefaultTextSize()
vs.Message('GetDefaultTextSize returned: ' + str(value))
```

## Version
Availability: from VectorWorks8.0

## Category
* Document Settings